// โจทย์ข้อที่ 1: ประกาศตัวแปรของคุณ
// - สร้างตัวแปรที่เป็นชื่อของคุณ (ห้ามเปลี่ยนค่าในอนาคต)
// - สร้างตัวแปรระบุอายุของคุณ (เปลี่ยนค่าเพิ่มขึ้นได้ในอนาคต)
// เขียนโค้ดด้านล่างนี้:

const name = "Nutthapong";
let age = 37;

// โจทย์ข้อที่ 2: ตรวจสอบ Data Type
// - มีตัวแปรประกาศไว้ให้ด้านล่าง ลองใช้คำสั่ง console.log(typeof ...) ตรวจสอบดูว่าเป็นชนิดข้อมูลอะไรบ้าง
const totalUser = 150;
const status = "pending";
let connection = null;
// เขียนโค้ดด้านล่างนี้:

console.log(typeof totalUser);
console.log(typeof status);
console.log(typeof connection);

// โจทย์ข้อที่ 3: ใช้ Template Literal
// - นำตัวแปรจากข้อที่ 1 มาแสดงผลให้อยู่ในประโยคว่า: "สวัสดีฉันชื่อ [ชื่อของคุณ] ปีนี้อายุ [อายุของคุณ] ปี"
// เขียนโค้ดด้านล่างนี้:

console.log(`สวัสดีฉันชื่อ ${name} ปีนี้อายุ ${age} ปี`);
